{"<bos>": 0, "<eos>": 1, "place (0,0)": 2, "place (0,1)": 3, "place (0,2)": 4, "place (0,3)": 5, "place (0,4)": 6, "place (0,5)": 7, "place (1,0)": 8, "place (1,1)": 9, "place (1,2)": 10, "place (1,3)": 11, "place (1,4)": 12, "place (1,5)": 13, "place (2,0)": 14, "place (2,1)": 15, "place (2,2)": 16, "place (2,3)": 17, "place (2,4)": 18, "place (2,5)": 19, "place (3,0)": 20, "place (3,1)": 21, "place (3,2)": 22, "place (3,3)": 23, "place (3,4)": 24, "place (3,5)": 25, "place (4,0)": 26, "place (4,1)": 27, "place (4,2)": 28, "place (4,3)": 29, "place (4,4)": 30, "place (4,5)": 31, "place (5,0)": 32, "place (5,1)": 33, "place (5,2)": 34, "place (5,3)": 35, "place (5,4)": 36, "place (5,5)": 37, "remove (0,0)": 38, "remove (0,5)": 39, "remove (1,0)": 40, "remove (1,1)": 41, "remove (1,2)": 42, "remove (1,3)": 43, "remove (1,4)": 44, "remove (1,5)": 45, "remove (2,0)": 46, "remove (2,1)": 47, "remove (2,2)": 48, "remove (2,3)": 49, "remove (2,4)": 50, "remove (2,5)": 51, "remove (3,0)": 52, "remove (3,1)": 53, "remove (3,2)": 54, "remove (3,3)": 55, "remove (3,4)": 56, "remove (3,5)": 57, "remove (4,0)": 58, "remove (4,1)": 59, "remove (4,2)": 60, "remove (4,3)": 61, "remove (4,4)": 62, "remove (4,5)": 63, "remove (5,0)": 64, "remove (5,1)": 65, "remove (5,2)": 66, "remove (5,3)": 67, "remove (5,4)": 68, "remove (5,5)": 69, "solved": 70, "state [0, 2, 4, 1, 3]": 71, "state [0, 2, 4, 1]": 72, "state [0, 2, 4]": 73, "state [0, 2, 5, 1]": 74, "state [0, 2, 5]": 75, "state [0, 2]": 76, "state [0, 3, 1, 4, 2]": 77, "state [0, 3, 1, 4]": 78, "state [0, 3, 1]": 79, "state [0, 3, 5, 2]": 80, "state [0, 3, 5]": 81, "state [0, 3]": 82, "state [0, 4, 1, 5, 2]": 83, "state [0, 4, 1, 5]": 84, "state [0, 4, 1]": 85, "state [0, 4]": 86, "state [0, 5, 1, 4]": 87, "state [0, 5, 1]": 88, "state [0, 5, 3, 1]": 89, "state [0, 5, 3]": 90, "state [0, 5]": 91, "state [0]": 92, "state [1, 3, 0, 2, 4]": 93, "state [1, 3, 0, 2]": 94, "state [1, 3, 0]": 95, "state [1, 3, 5, 0, 2]": 96, "state [1, 3, 5, 0, 4]": 97, "state [1, 3, 5, 0]": 98, "state [1, 3, 5, 2, 4]": 99, "state [1, 3, 5, 2]": 100, "state [1, 3, 5]": 101, "state [1, 3]": 102, "state [1, 4, 0, 3]": 103, "state [1, 4, 0, 5, 3]": 104, "state [1, 4, 0, 5]": 105, "state [1, 4, 0]": 106, "state [1, 4, 2, 0, 3]": 107, "state [1, 4, 2, 0]": 108, "state [1, 4, 2, 5, 3]": 109, "state [1, 4, 2, 5]": 110, "state [1, 4, 2]": 111, "state [1, 4]": 112, "state [1, 5, 0, 2, 4]": 113, "state [1, 5, 0, 2]": 114, "state [1, 5, 0]": 115, "state [1, 5, 2, 0, 3]": 116, "state [1, 5, 2, 0]": 117, "state [1, 5, 2]": 118, "state [1, 5]": 119, "state [1]": 120, "state [2, 0, 3, 1, 4]": 121, "state [2, 0, 3, 1]": 122, "state [2, 0, 3]": 123, "state [2, 0, 5, 1, 4]": 124, "state [2, 0, 5, 1]": 125, "state [2, 0, 5, 3, 1]": 126, "state [2, 0, 5, 3]": 127, "state [2, 0, 5]": 128, "state [2, 0]": 129, "state [2, 4, 1, 3, 0]": 130, "state [2, 4, 1, 3, 5]": 131, "state [2, 4, 1, 3]": 132, "state [2, 4, 1]": 133, "state [2, 4]": 134, "state [2, 5, 1, 4, 0]": 135, "state [2, 5, 1, 4]": 136, "state [2, 5, 1]": 137, "state [2, 5, 3, 0, 4]": 138, "state [2, 5, 3, 0]": 139, "state [2, 5, 3, 1, 4]": 140, "state [2, 5, 3, 1]": 141, "state [2, 5, 3]": 142, "state [2, 5]": 143, "state [2]": 144, "state [3, 0, 2, 4, 1]": 145, "state [3, 0, 2, 4]": 146, "state [3, 0, 2, 5, 1]": 147, "state [3, 0, 2, 5]": 148, "state [3, 0, 2]": 149, "state [3, 0, 4, 1, 5]": 150, "state [3, 0, 4, 1]": 151, "state [3, 0, 4]": 152, "state [3, 0]": 153, "state [3, 1, 4, 2, 0]": 154, "state [3, 1, 4, 2, 5]": 155, "state [3, 1, 4, 2]": 156, "state [3, 1, 4]": 157, "state [3, 1]": 158, "state [3, 5, 0, 2, 4]": 159, "state [3, 5, 0, 2]": 160, "state [3, 5, 0, 4, 1]": 161, "state [3, 5, 0, 4]": 162, "state [3, 5, 0]": 163, "state [3, 5, 2, 4, 1]": 164, "state [3, 5, 2, 4]": 165, "state [3, 5, 2]": 166, "state [3, 5]": 167, "state [3]": 168, "state [4, 0, 3, 5, 2]": 169, "state [4, 0, 3, 5]": 170, "state [4, 0, 3]": 171, "state [4, 0, 5, 3, 1]": 172, "state [4, 0, 5, 3]": 173, "state [4, 0, 5]": 174, "state [4, 0]": 175, "state [4, 1, 3, 0, 2]": 176, "state [4, 1, 3, 0]": 177, "state [4, 1, 3, 5, 2]": 178, "state [4, 1, 3, 5]": 179, "state [4, 1, 3]": 180, "state [4, 1, 5, 0, 2]": 181, "state [4, 1, 5, 0]": 182, "state [4, 1, 5, 2]": 183, "state [4, 1, 5]": 184, "state [4, 1]": 185, "state [4, 2, 0, 3, 1]": 186, "state [4, 2, 0, 3]": 187, "state [4, 2, 0, 5, 1]": 188, "state [4, 2, 0, 5, 3]": 189, "state [4, 2, 0, 5]": 190, "state [4, 2, 0]": 191, "state [4, 2, 5, 3, 1]": 192, "state [4, 2, 5, 3]": 193, "state [4, 2, 5]": 194, "state [4, 2]": 195, "state [4]": 196, "state [5, 0, 2, 4]": 197, "state [5, 0, 2]": 198, "state [5, 0, 4, 1]": 199, "state [5, 0, 4]": 200, "state [5, 0]": 201, "state [5, 1, 4, 0, 3]": 202, "state [5, 1, 4, 0]": 203, "state [5, 1, 4]": 204, "state [5, 1]": 205, "state [5, 2, 0, 3]": 206, "state [5, 2, 0]": 207, "state [5, 2, 4, 1, 3]": 208, "state [5, 2, 4, 1]": 209, "state [5, 2, 4]": 210, "state [5, 2]": 211, "state [5, 3, 0, 4]": 212, "state [5, 3, 0]": 213, "state [5, 3, 1, 4, 2]": 214, "state [5, 3, 1, 4]": 215, "state [5, 3, 1]": 216, "state [5, 3]": 217, "state [5]": 218, "state []": 219}